app/controllers/accounts_controller.rb

INSERT INTO "users" ("created_at", "email", "hashed_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def register
    @user = User.new(params[:user])
    if @user.save