app/controllers/bookmarks_controller.rb

  def index
    @bookmarks_active = 'active'
    user_id = session[:user].id
    @bookmarks = Bookmark.where(:user_id => user_id).paginate(:page => params[:page], :order => 'added_on desc', :per_page => 10)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 4 ORDER BY added_on desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "bookmarks" WHERE "bookmarks"."user_id" = 4

  def show
    if does_not_own_bookmark?(params[:id])
      redirect_to accounts_logout_url
      return
    end
    @bookmarks_active = 'active'
    @bookmark = Bookmark.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "popular"]]

  def create
    @bookmark = Bookmark.new(params[:bookmark])
    @bookmark.added_on = Time.new
    @bookmark.user_id = session[:user].id
    wp = WebPage.find_by_url(@bookmark.web_page.url)
    if !wp
      wp = WebPage.create(:url => @bookmark.web_page.url)
    end
    @bookmark.web_page_id = wp.id

    if @bookmark.save
---
SELECT "web_pages".* FROM "web_pages" WHERE "web_pages"."url" = 'http://rediff.com' LIMIT 1
INSERT INTO "bookmarks" ("added_on", "created_at", "is_pinned", "name", "notes", "updated_at", "user_id", "web_page_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "web_pages" ("created_at", "last_crawled_on", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Sat, 22 Dec 2012 10:50:07 UTC +00:00], ["last_crawled_on", nil], ["updated_at", Sat, 22 Dec 2012 10:50:07 UTC +00:00], ["url", "http://rediff.com"]]
UPDATE "web_pages" SET "url" = NULL, "updated_at" = '2012-12-22 10:50:07.918152' WHERE "web_pages"."id" = 88

  def destroy
    if does_not_own_bookmark?(params[:id])
      redirect_to accounts_logout_url
      return
    end
    @bookmark = Bookmark.find(params[:id])
    @bookmark.destroy
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "93"]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 93]]

  def edit
    if does_not_own_bookmark?(params[:id])
      redirect_to accounts_logout_url
      return
    end
    @bookmarks_active = 'active'
    @bookmark = Bookmark.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "64"]]

  def update
    if does_not_own_bookmark?(params[:id])
      redirect_to accounts_logout_url
      return
    end
    @bookmark = Bookmark.find(params[:id])
    if @bookmark.update_attributes(params[:bookmark])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "64"]]
UPDATE "bookmarks" SET "notes" = 'showing off to mangy', "updated_at" = '2012-12-22 23:23:54.677730' WHERE "bookmarks"."id" = 84

  def pin
    if does_not_own_bookmark?(params[:id])
      redirect_to accounts_logout_url
      return
    end
    bookmark = Bookmark.find(params[:id])
    bookmark.is_pinned = true
    if bookmark.update_attributes(params[:boomark])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "94"]]
UPDATE "bookmarks" SET "is_pinned" = 't', "updated_at" = '2012-12-23 00:15:23.956680' WHERE "bookmarks"."id" = 94

  def popular
    @pop_bookmarks_active = 'active'
    @pop_links = WebPage.select('w.id, w.url, w.title, count(w.id) as popularity').
                  joins('as w inner join bookmarks as b on w.id = b.web_page_id').
                  group('w.id').
                  having('popularity >= 3')
---
SELECT w.id, w.url, w.title, count(w.id) as popularity FROM "web_pages" as w inner join bookmarks as b on w.id = b.web_page_id GROUP BY w.id HAVING popularity >= 3