app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'avilayp', "salt" = '702820417743200.2223599493027678', "hashed_password" = '6225277213ec2b09b76613bfbd10b508fb92b5cf91453c0d0de3ecb1aacf88ed', "updated_at" = '2012-12-23 09:16:26.127293' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])